// Common Strings
"Okay" = "OK";
"Cancel" = "キャンセル";

// Servers
"RFBDefaultServerName" = "新規サーバ";
"RFBUntitledServerName" = "名称未設定";
"Connecting..." = "接続中...";
"Connect" = "接続";
"DisplayIsPort" = "Display %d is port %d";
"PortIsDisplay" = "Port %d is display %d";
"PortNum" = "Port %d";

// Error Actions
"OpenConnection" = "接続中";
"NoNamedServer" = "サーバ \"%@\" が見つかりませんでした。";
"NoConnection" = "サーバ %@:%d に接続できませんでした。";
"NoReconnection" = "Could not reconnect to server %@";
"NotVNC" = "Not a VNC server";
"UnknownAuthType" = "未知の認証方式 %@";
"UnknownAuthResult" = "未知の認証結果 %@";
"AuthenticationFailed" = "認証に失敗しました";
"AuthenticationFailedTooMany" = "認証に失敗しました（回数オーバー）";
"UnknownMessageType" = "未知のメッセージタイプ %@";
"ServerReports" = "サーバからの応答";
"ARDAuthWarning" = "\nVNC Viewer による操作を許可するよう Apple Remote Desktop を設定してください。\n";

// Profiles
"defaultProfileName" = "デフォルト";
"EditProfiles" = "Edit Connection Profiles...";

// Couldn't connect
"ConnectRefused" = "The server refused the connection";
"ConnectTimedOut" = "The connection attempt timed out";

// SSH-related errors
"SshOtherError" = "Problem connecting with ssh";
"SshKeyMismatch" = "Remote SSH identification has changed. Someone maybe trying to eavesdrop on the conversation";
"SshCatError" = "Error with cat";
"SshPermissionError" = "Permission error with ssh script";

// Connection Terminated
"ConnectionTerminated" = "終了";
"Reconnect" = "再接続";
"ServerClosed" = "接続が切断されました。";
"ServerError" = "サーバを保存：%s";
"ProtocolError" = "Protocol error";
"ZrleTooSmall" = "ZRLE encoding: rectangle contained insufficient data";
"ZrleUnknownSubencoding" = "ZRLE encoding: unknown subencoding %d encountered";
"ZlibHexInflateError" = "ZlibHex encoding: inflate error: %s";
"ZlibHexDeflateTooSmall" = "ZlibHex encoding: deflate size smaller than expected";
"ZlibNeedsDict" = "Zlib encoding: inflate needs a dictionary";
"ZlibInflateError" = "Zlib encoding: inflate error: %s";
"TightBadSubencoding" = "Tight encoding: unknown subencoding received";
"TightUnknownFilter" = "Tight encoding: unknown filter code %@ received.";
"TightZeroPalette" = "Tight encoding: palette with length 0 received";
"TightWrongJpeg" = "Tight encoding: Wrong JPEG data received.";
"UnknownRectangle" = "Unknown rectangle encoding %d -> exiting";
"TightInflateInitErrorWith" = "InflateInit error: %s.\n";
"TightInflateInitError" = "InflateInit error\n";
"TightInflateErr" = "Inflate error\n";
"ZlibInflateInitErr" = "Zlib encoding: inflateInit: %s.\n";
"ZlibHexInflateErr" = "ZlibHex inflate error: %s";
"InflateInit" = "Inflate initialization error: %d, %s";
"InflateError" = "Inflate error: %d, %s";
"InflateMem" = "Inflate: couldn't allocate memory";

// Fullscreen
"FullscreenHeader" = "フルスクリーンモードに切り替えます";
"Fullscreen" = "フルスクリーン";
"FullscreenReason1" = "通常モードに戻すには、適切な修飾キーを押してください。この修飾キーは環境設定でお好みのキーに変更することができます。";
"FullscreenReason2" = "";
"FullscreenNoKeyHeader" = "Warning: No key for exiting fullscreen";
"FullscreenNoKey" = "There is no key equivalent set for returning to windowed mode. You can set this in preferences. Are you sure that you want to enter fullscreen mode without a key equivalent to exit?";

// Listener
"listenStart" = "開始";
"listenStop" = "停止";
"listenRunning" = "稼働中です";
"listenStopped" = "稼働していません";
"listenAcceptMessage" = "接続元：%@:%d";

// Rendezvous
"AddressResolveFailed" = "アドレス解決に失敗しました";
"Resolving" = "サーバ名を解決中...";

// Connection Info
"ConnectionStatistics" = "Bytes Received: %@\nBytes Represented: %@\nCompression: %.2f\nRectangles: %u\nEncodings:%@";
"ServerInfo" = "VNC Protocol Version: %d.%d\nVNC Screensize: %dx%d\nProtocol Parameters\n\tBits Per Pixel: %d\n\tDepth: %d\n\tByteorder: %@\n\tTruecolor: %@\n\tMaxValues (r/g/b): %d/%d/%d\n\tShift (r/g/b): %d/%d/%d";
"big-endian" = "big-endian";
"little-endian" = "little-endian";
"yes" = "yes";
"no" = "no";

// SSH
"FirstTimeHeader" = "First time connecting";
"FirstTimeMessage" = "The authenticity of the server could not be established.  Are you sure you want to continue connectiong?";
